{
  "backend/main.mo": "Defines an empty Motoko actor with no functionality.",
  "feature_evidence.json": "Lists feature evidence entries describing puzzle text update, puzzle interaction fixes, and post‑puzzle behavior, each mapping to specific frontend component files.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries for all major frontend components including puzzle, animations, styling, and UI elements.",
  "frontend/index.css": "Defines Tailwind base layers and an OKLCH‑based Valentine color theme with light and dark variants.",
  "frontend/index.html": "HTML entry point setting the page title and loading the React app root.",
  "frontend/src/App.tsx": "Main React component handling layout, puzzle visibility, completion state, and Valentine greeting display.",
  "frontend/src/components/CelebrationSparkles.tsx": "Renders sparkle and heart‑confetti animations triggered on puzzle completion.",
  "frontend/src/components/CoolingFan.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/FloatingHearts.tsx": "Generates drifting animated heart images across the screen as a decorative overlay.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer showing 'Credits: Brother'.",
  "frontend/src/components/Header.tsx": "Shows the page header with Valentine‑themed text and heart icons.",
  "frontend/src/components/HeartPuzzleCTA.tsx": "Provides a heart‑themed button that toggles the puzzle visibility state.",
  "frontend/src/components/JigsawPuzzleName.tsx": "Implements a canvas‑based draggable jigsaw puzzle displaying the text 'Love you akka 💖' with completion detection.",
  "frontend/src/components/PuzzleRevealSection.tsx": "Manages puzzle visibility, completion handling, celebration effects, and message reveal flow.",
  "frontend/src/components/Snowfall.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/SnowflakeGame.tsx": "Empty placeholder file containing no game implementation.",
  "frontend/src/components/ValentineMessageReveal.tsx": "Animated Valentine message card component with heart icons and reveal-on-mount transition.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor instance tied to the user’s Internet Identity, refreshing queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, including login, logout, stored identity loading, and status tracking.",
  "frontend/src/index.css": "Tailwind CSS setup defining Valentine-themed color variables, gradients, card styles, text effects, and animations.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up React Query, and wraps the app with the Internet Identity provider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors with Valentine palette and adding plugins, utilities, and custom keyframes.",
  "project_state.json": "Metadata describing project state, Valentine features, requirements, and known issues for ongoing development."
}