{
  "backend/main.mo": "Empty actor module with a comment pointing to the permanent live deployment URL.",
  "feature_evidence.json": "Feature evidence report listing deployment-related features, associated files, components, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-like text containing prewritten summaries for all frontend source files.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining slug rules and step‑by‑step instructions for deploying to the Internet Computer.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables defining the Valentine theme for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app and setting the Valentine-themed page title.",
  "frontend/LIVE_URL.md": "Document recording the permanent live site URL and deployment details for the Valentine’s Surprise app.",
  "frontend/src/App.tsx": "Main React component composing the Valentine greeting, floating hearts, puzzle CTA, puzzle section, and footer.",
  "frontend/src/components/CelebrationSparkles.tsx": "Generates sparkle particles and heart confetti animations as a celebratory overlay.",
  "frontend/src/components/CoolingFan.tsx": "Empty component file with no implementation.",
  "frontend/src/components/FloatingHearts.tsx": "Creates 15 animated floating heart images with randomized movement and timing.",
  "frontend/src/components/Footer.tsx": "Footer displaying a simple credit message \"Credits: Brother\".",
  "frontend/src/components/Header.tsx": "Header showing the Valentine greeting with animated heart icons.",
  "frontend/src/components/HeartPuzzleCTA.tsx": "Heart‑themed button toggling the visibility of the puzzle section.",
  "frontend/src/components/JigsawPuzzleName.tsx": "Canvas-based jigsaw puzzle rendering \"Love you akka 💖\" with draggable pieces and completion detection.",
  "frontend/src/components/PuzzleRevealSection.tsx": "Controls puzzle visibility, completion handling, and triggers celebration effects and message reveal.",
  "frontend/src/components/Snowfall.tsx": "Empty placeholder component file.",
  "frontend/src/components/SnowflakeGame.tsx": "Empty placeholder component file.",
  "frontend/src/components/ValentineMessageReveal.tsx": "Animated Valentine message card with heart icons and styled text revealed on mount.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login handling, stored identity loading, and state management.",
  "frontend/src/index.css": "Defines Tailwind base styles, Valentine-themed color variables, animations, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps React app with QueryClient and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, color tokens, plugins, and extended UI settings.",
  "project_state.json": "Describes project state, deployment issues, and feature requests related to domain validation and publishing."
}