{
  "kind": "build_request",
  "title": "Deploy Valentine’s wish site to a permanent Internet Computer live URL",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Publish the current Valentine’s wish/Valentine’s Surprise project as a permanent (non-expiring) live site on the Internet Computer using the platform-provided default domain (no custom domain configuration).",
      "target": "unknown",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Deploy",
          "Publish",
          "Make the website permanent"
        ]
      },
      "acceptanceCriteria": [
        "A production/live deployment is completed successfully (no deployment error).",
        "The deployed site is reachable via an https://<slug>.icp0.io URL (default platform domain).",
        "The live site serves the current project content without requiring further manual steps."
      ]
    },
    {
      "id": "REQ-2",
      "text": "If the deployment workflow requires specifying a domain/slug, generate and use a random valid slug that is 5–50 characters and contains only letters, numbers, and hyphens.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "project_state.json"
        ],
        "quotes": [
          "If the deployment workflow requires specifying a domain/slug, generate and use a random valid slug that is 5–50 characters and contains only letters, numbers, and hyphens."
        ]
      },
      "acceptanceCriteria": [
        "The chosen slug passes validation (length 5–50; only [a-z0-9-]).",
        "Deployment succeeds using the generated slug without further user input."
      ]
    }
  ],
  "constraints": [
    "Use the default Internet Computer platform domain only; do not configure a custom domain.",
    "Deploy the exact previously generated/current version of the project with no feature changes (deployment-only work).",
    "After a successful deployment, keep in-repo references to the permanent live URL consistent with the newly deployed URL (handled by existing feature: update frontend/LIVE_URL.md and the live-URL comment in backend/main.mo)."
  ],
  "nonGoals": [
    "Add new site features, games, or UI changes unrelated to making deployment succeed.",
    "Set up third-party hosting, external databases, or non-Internet-Computer deployment targets."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}