{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Permanent Internet Computer deployment (default domain) for Valentine’s wish site",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the current Valentine’s Surprise project is published as a permanent live site on the Internet Computer using the default icp0.io domain, and keep in-repo live URL references consistent.",
      "acceptanceCriteria": [
        "A production/live deployment is completed successfully (no deployment error).",
        "The deployed site is reachable via an https://<slug>.icp0.io URL (default platform domain).",
        "The live site serves the current project content without requiring further manual steps."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Update the deployment guide to reflect the exact current, platform-default-domain permanent deployment workflow (no custom domain), explicitly referencing the repository’s deployment tooling (github-export-icp-cli) and emphasizing deployment-only work. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/LIVE_URL.md",
          "operation": "modify",
          "description": "Update the recorded permanent live URL and deployment details to match the newly deployed https://<slug>.icp0.io address after successful deployment, keeping the URL consistent across repo references per constraints (frontend doc side)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Support deployment workflows that require a slug by generating and using a random valid slug (5–50 chars; lowercase letters, numbers, hyphens).",
      "acceptanceCriteria": [
        "The chosen slug passes validation (length 5–50; only [a-z0-9-]).",
        "Deployment succeeds using the generated slug without further user input."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Add a deployment-note section documenting the slug generation/validation rule (5–50 chars; only [a-z0-9-]) and how to apply it when the platform workflow prompts for a slug, without introducing any feature/UI changes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/LIVE_URL.md",
          "operation": "modify",
          "description": "Ensure the final chosen slug is recorded in the deployment details section alongside the final permanent icp0.io URL so repo references remain consistent after deployment."
        }
      ]
    }
  ]
}